// Laba2.cpp : Этот файл содержит функцию "main". Здесь начинается и заканчивается выполнение программы.
//



#include <iostream>
using namespace std;

#include <iostream>
#include <cstdlib>  // для rand()
#include <ctime>    // для time()
using namespace std;

int** createMatrix(int n, int m) {
    int* arr = new int[5][5];
    // ТВОЯ ЗАДАЧА: написать эту функцию
    // 1. Выделить память для двумерного массива
    // 2. Заполнить каждый элемент случайным числом
}

int main() {
    srand(time(0)); // Инициализация генератора случайных чисел

    int n = 3, m = 4;
    int** matrix = createMatrix(n, m);

    // Вывод матрицы (покажу я)
    for (int i = 0; i < n; i++) {
        for (int j = 0; j < m; j++) {
            cout << matrix[i][j] << " ";
        }
        cout << endl;
    }

    // TODO: не забудь освободить память!
    return 0;
}








/*void lel() {
    int arr[5] = {2,4,6,7,10};
    int* pv = arr+4;
    auto i = 5;
    auto sume = 0;
    auto z = 0;
    auto max = 0;
    auto chot = 0;
while(i>0){
    cout << *pv << " ";
    sume += *pv;
    z = *pv;
    pv--;
    i --;
    if (z > max) {
        max = z;
        z = 0;
    }
    if (z % 2 == 0) {
        chot++;
    }
    
    }
cout << "max:" << max << " ";
cout << "cumma " << sume << "   ";
cout << "chot " << chot << "    ";
}

int main()
{
    lel();
    return 0;
    cout << "Hello World!\n";
}

// Запуск программы: CTRL+F5 или меню "Отладка" > "Запуск без отладки"
// Отладка программы: F5 или меню "Отладка" > "Запустить отладку"

// Советы по началу работы 
//   1. В окне обозревателя решений можно добавлять файлы и управлять ими.
//   2. В окне Team Explorer можно подключиться к системе управления версиями.
//   3. В окне "Выходные данные" можно просматривать выходные данные сборки и другие сообщения.
//   4. В окне "Список ошибок" можно просматривать ошибки.
//   5. Последовательно выберите пункты меню "Проект" > "Добавить новый элемент", чтобы создать файлы кода, или "Проект" > "Добавить существующий элемент", чтобы добавить в проект существующие файлы кода.
//   6. Чтобы снова открыть этот проект позже, выберите пункты меню "Файл" > "Открыть" > "Проект" и выберите SLN-файл.
*/